{
  "pages": [
    "Cuba is a beautiful island in the Caribbean Sea with a long, complicated history. In this book, you’ll learn how Cuba changed over time. From its first peoples, to Spanish rule, to independence, and eventually, life today.",
    "Long before any Europeans arrived, Indigenous peoples like the Taíno and Guanahatabey lived in Cuba. They fished, farmed, and built small villages. They respected nature and used the land carefully, taking only what they needed.",
    "These early Cubans grew crops like cassava and maize, paddled canoes along rivers, and made pottery and tools. They told stories, played music, and raised families on the island for hundreds of years without outside rule.",
    "In 1492, explorer Christopher Columbus reached Cuba while sailing for Spain. Soon, more Spanish ships followed. At first, some Indigenous people welcomed them, but the Spanish wanted land, gold, and power, not just friendship.",
    "Spain claimed Cuba as its colony. Spanish leaders took control of the land and forced many Indigenous people to work for them. New diseases brought by Europeans killed large numbers of the original inhabitants, and their way of life was nearly destroyed.",
    "Spain turned Cuba into a giant farm for sugar and other crops. To work the fields, the Spanish brought enslaved Africans across the ocean in terrible conditions. Enslaved people cut sugarcane under the hot sun with almost no rights or freedom.",
    "Over time, Cuba’s people became a mix of Indigenous, African, and European roots. They created rich music, food, and traditions. But society was unfair; a small group of wealthy families and Spanish-born colonists had most of the power and money.",
    "By the 1800s, many Cubans were tired of Spanish control and slavery. Some leaders began to talk about freedom and independence for all Cubans, no matter their race. They wanted Cuba to belong to its own people, not to a faraway king.",
    "In 1868, Cuban leaders like Carlos Manuel de Céspedes started the Ten Years’ War against Spain. They fought for independence and the end of slavery. The war was long and bloody, and although slavery was finally abolished, Cuba still was not free.",
    "A writer and leader named José Martí helped organize a new fight for independence in the 1890s. He believed Cuba should be free from Spain and died as a hero in battle. He left behind a powerful collection of poems, essays, and speeches, including La Edad de Oro (\"The Golden Age\"), which is now a book that holds stories so kids could learn to think, be kind, and love freedom.",
    "In 1898, the United States joined Cuba’s war against Spain. Spain lost the war and gave up control of Cuba. However, the U.S. government kept strong influence over the island for years, limiting Cuba’s full independence but also affecting its development and security.",
    "In 1902, Cuba became a republic with its own flag and president. Havana grew with tall buildings, busy streets, and a lively nightlife. Some Cubans became wealthy, and foreign companies invested money in sugar and tobacco. Cuba also became a hotbed for wealthy tourism and leisure.",
    "Behind the bright lights, many problems remained. In the countryside, farmers were poor and often worked land they did not own. Corruption, which is leaders using power for themselves, was common in politics. Some governments ignored the needs of ordinary people.",
    "Throughout the early 1900s, Cuba had unstable governments, coups, and strongmen. In the 1950s, Fulgencio Batista ruled as a dictator. He promised order but allowed corruption and harsh policing. Many Cubans wanted change and felt they had no real voice.",
    "Around the world, some leaders followed communism, an idea where the government owns most property and plans the economy. In communist systems, there is usually only one political party. Supporters say it can make things equal, but it often takes away important freedoms, like free elections and free speech.",
    "A group of rebels led by Fidel Castro fought against Batista. After years of fighting, Batista fled in 1959, and the rebels took power. Many people celebrated at first, hoping this new government would bring fairness and end corruption.",
    "Soon after taking power, Castro and his allies turned Cuba into a communist state. The government took over businesses, banks, and large farms against the owners’ will. There would be only one legal party: the Communist Party of Cuba. People could no longer choose between different parties in elections.",
    "The government opened more schools and sent doctors to rural areas which helped literacy rates, and healthcare amongst the poor. But many schools and clinics did not have enough books, medicine, or modern equipment, and some lessons were very controlled by the government, making the quality of these services very poor. The state also controlled newspapers, TV, and radio. Freedoms were limited, speaking against the government could lead to imprisonment",
    "Food, clothing, and many goods were rationed. Families used ration books to get limited amounts of rice, beans, and other basics. Stores often had long lines and empty shelves. People had jobs, but salaries were low, and it was hard to improve their lives through their own effort or business.",
    "Neighborhood groups called Committees for the Defense of the Revolution watched over communities. They reported suspicious behavior to the government. Many people felt nervous about speaking openly, even at home, because they feared someone might tell on them.",
    "Because of lost freedoms, taken businesses, and shortages, many Cubans decided to leave. Some left by plane. Others used small boats and rafts, risking their lives to reach places like the United States. Many families were split apart, with some members in Cuba and others abroad.",
    "Cuba formed a close partnership with the Soviet Union, another communist country. In 1962, the world came close to nuclear war when Soviet missiles were placed in Cuba. After this crisis, the United States kept a trade embargo, making it harder for Cuba to buy and sell goods with its giant neighbor.",
    "When the Soviet Union collapsed around 1991, Cuba lost a major source of money, oil, and support. The 1990s became known as the Special Period. There were frequent blackouts, very little fuel, and serious food shortages. Many Cubans struggled to find enough to eat.",
    "During hard times, some Cubans protested for better conditions and more freedom. In 1994, people gathered along the Malecón in Havana in a protest called the Maleconazo. The government quickly stopped the protest using harsh tactics, and political control stayed tight.",
    "Fidel Castro ruled for many decades, then handed power to his brother Raúl, and later to Miguel Díaz-Canel. The Communist Party still holds most power, and other political parties are not allowed to compete in free elections. Many Cubans continue to demand more rights and better living conditions.",
    "Today, Cuba continues to struggle. Energy, food, medicine, and basic goods are scarce. Internet access and free expression are still limited. People continue to protest against the government and attempt to escape to other countries despite the severe consequences they can face.",
    "Despite difficulties, Cuban culture shines around the world. Styles like son, salsa, and rumba fill streets with music. People play baseball, box, and dance at family parties. Artists, writers, and musicians express pride in their island and their desire for freedoms.",
    "Millions of Cubans and their children live outside the island, especially in places like Miami, Florida. They bring Cuban food, music, and traditions to their new homes. Many send money back to their family in Cuba in order for them to survive. They all hope to one day be reunited and to see more freedom and opportunity in this beautiful island."
  ]
}